[Main]
Abort=Прекратить
About=О программе
Add=Добавить
Address=Адрес
AddressNotFound=Адрес "%.8x" не найден
AddressUsedByProcedure=Адрес используется процедурой "%s"
AddWatermark=Добавить водяной знак
All=Все
AllFiles=Все файлы
AllProcedures=Все процедуры
AutoSaveProject=Автосохранение проекта после компиляции
Back=Назад
Best=Лучший (медленная распаковка)
BreakAddress=Окончание процедуры
Calculate=Вычислить
Calculator=Калькулятор
Calls=Вызовы процедур
Cancel=Отмена
ClearHistory=Очистить историю
Close=Закрыть
CloseFolders=Закрыть все папки
CodeSectionNotFound=Не найдена секция "CODE"
CommandNotSupport=Команда не поддерживается
Commands=Команды
CommandsWithConditions=Команды с внутренними условиями
CompilationType=Тип компиляции
Compile=Компиляция
Compiled=Компиляция завершена
CompilerMessages=Сообщения компилятора
ConditionalJumps=Условные переходы
Confirm=Подтверждение
Contents=Содержание
Continue=Продолжить
Copy=Копировать
Count=Количество
CreateFileError=Не могу создать файл "%s"
CryptValues=Скрывать константы
Cut=Вырезать
Debug=Режим отладки (определение внешних адресов)
Debugger=Отладчик
DecreaseIsSpeed=снижение скорости
Del=Удалить
Delete=Удалить
Deleting=Удаление
DelFolder=Удалить папку
DelProcedure=Удалить процедуру
DelWatermark=Удалить водяной знак
Demo=Демо версия
DemoLimit=В незарегистрированной версии можно защитить только одну процедуру
Detection=Обнаружение
Direction=Направление
Directories=Директории
DoFind=Искать
Down=Вниз
DragFileToOpen=Перетащите сюда файл для открытия
Dump=Дамп
DynamicOnlineCommands=Динамическое создание онлайн команд
Edit=Изменить
EditFolder=Изменить папку
EditProcedure=Изменить процедуру
EditWatermark=Изменить водяной знак
EmptyCompile=Нет данных для компиляции
EmptyFileName=Не указано имя файла
EmptyModule=Не указан модуль
EmptyProcess=Не указан процесс
EnabledForUse=Доступен для использования
EncryptRegisters=Шифрация регистров на выходе из ВМ
Error=Ошибка
Execute=Запустить
ExecutedFiles=Исполняемые файлы
Exit=Выход
Expert=Эксперт
Export=Экспорт
ExtAddress=Внешний адрес
ExternalAdresses=Внешние адреса
Fast=Быстрый (быстрая распаковка)
File=Файл
FileInfo=Свойства
FileIsNotDLL=Файл "%s" не является x%d DLL
FileName=Имя файла
FileOffset=Смещение в файле
FilePacked=Возможно файл "%s" упакован.Загрузить файл проекта?
FileUnknownFormat=Файл "%s" имеет неизвестный формат
Find=Найти
FindNext=Найти дальше
Flags=Флаги
FoundUnpairedMarkers=Найдено %d непарных маркеров
Generate=Сгенерировать
Goto=Перейти на адрес
Help=Справка
Hint=Подсказка
HomePage=Домашняя страница
Ignore=Пропустить
Import=Импорт
ImportProtection=Защита импорта
IncludeInCompilation=Включить в компиляцию
Information=Информация
InvalidAddress=Неверный адрес
InvalidCPUType=Процессор "%s" не поддерживается
InvalidFormat=Файл "%s" имеет некорректный %s формат
InvalidKeyID=Некорректный идентификатор ключа
InvalidOSType=Операционная система "%s" не поддерживается
JmpOnExternalAddress=Переход на внешний адрес: %.8x
JmpOnInternalAddress=Переход на внутренний адрес: %.8x
JumpOnCommandPart=Переход на часть команды
Jumps=Переходы
Key=Ключ
KeyIdentifier=Идентификатор ключа
Language=Язык
Legend=Легенда
Level=Режим
License=Лицензия
LicenseNumber=Номер лицензии
LicenseOptions=Процедуры используют единые опции лицензирования
LicenseDataNotFound=Параметры лицензирования не найдены в файле "%s"
LicensingParameters=Параметры лицензирования
LicensingSystemNotSupport=Система лицензирования недоступна в этой версии
Loading=Загрузка
LockToKey=Привязать к ключу
LockToSerialNumber=Привязать к серийному номеру
MAPFileHaveIncorrectTimeStamp=MAP файл имеет некорректную дату и время модификации и не будет загружен
MasterKeyPassword=Пароль к мастер ключу
MatchCase=С учётом регистра
MaxProtection=Максимальная защита
MaxSpeed=Максимальная скорость
MemoryProtection=Защита памяти
MinGateSize=Минимальный размер процедуры для компиляции 5 байт
Module=Модуль
ModuleOpenError=Не могу открыть модуль "%s"
ModuleUnknownFormat=Модуль "%s" имеет неизвестный формат
MoveDown=Переместить вниз
MoveResourcesToEnd=Перемещать ресурсы в конец файла
MoveUp=Переместить вверх
Mutation=Мутация
Name=Название
New=Добавить
NewFolder=Добавить папку
NewObjects=Новые маркеры и строки
NewProcedure=Добавить процедуру
Next=Дальше
No=Нет
NoPlaceForGate=Нет места для создания переходника
NoToAll=Нет для всех
NotUseLicense=Без привязки к лицензии
OK=ОК
OnlineCommands=Онлайн команды
Open=Открыть
OpenFile=Открыть файл
OpenFolders=Открыть все папки
OpenNewFile=Открыть новый файл
OptionAvialable=Опция "%s" недоступна в незарегистрированной версии
Options=Опции
Ordinal=Ординал
Other=Другой
OutputFile=Выходной файл
OutputFileSize=Размер выходного файла %d байт (%d%%)
Packing=Упаковка
PackOutputFile=Упаковать выходной файл
Parameters=Параметры
Paste=Вставить
Pointer=адрес
Procedure=Процедура
ProcedureNotFoundInMAP=Процедура "%s" не найдена в списке объектов
ProceduresForProtect=Процедуры для защиты
Process=Процесс
Project=Проект
ProjectFile=Файл проекта
ProjectFiles=Файлы проекта
PushOriginalAddress=Сохранение в стеке оригинального адреса: %.8x
Redo=Повторить
References=Ссылки
RegisteredTo=Зарегистровано на
RelativeAddress=Относительный адрес
Resources=Ресурсы
Retry=Повторить
RunnerCRC=Контроль целостности ВМ объектов
SaveProject=Сохранить проект
SaveProjectAs=Сохранить проект как
Script=Скрипт
ScriptFile=Файл скрипта
ScriptMessages=Сообщения скрипта
Search=Поиск
SearchInFile=Поиск в файле
SearchInProcess=Поиск в процессе
Section=Секция
SectionNotPacked=Секция "%s" не может быть упакована
SectionPosUsedByDir=Директория "%s" находится в области создания заголовка новой секции
SectionPosUsedBySection=Секция "%s" находится в области создания заголовка новой секции
Sections=Секции
SEHNotSupported=Обработка исключений не поддерживается: %.8x
SelectAll=Выделить все
SelectProceduresForProtect=Выбрать процедуры для защиты
Settings=Настройка
Setup=Настройка
ShellExt=Интегрировать в оболочку
ShowAll=Показать все
Size=Размер
SortByName=Отсортировать список процедур по названию?
SortByType=Отсортировать список процедур по типу компиляции?
String=строка
Strings=Строки
StringDeprecated=Для защиты строк используйте VMProtectDecryptStringA/VMProtectDecryptStringW
StripFixups=Удалять настраиваемые элементы (только для EXE файлов)
Text=Текст
TextNotFound=Текст "%s" не найден
Thanks=Благодарности
Toolbars=Панели инструментов
Tools=Инструменты
Type=Тип
Ultra=Ультра (мутация + виртуализация)
Undo=Вернуть
Unregistered=Незарегистрированная версия
Up=Вверх
Usage=Использование
UseLicense=С привязкой к лицензии
UseProjectOptions=Использовать опции проекта
UserPIN=PIN код пользователя
Value=Значение
ValuesFor=Значения для
Variable=переменная
Version=Версия
VersionNumber=Номер версии
View=Вид
Virtualization=Виртуализация
VirtualMachines=Виртуальные Машины
VMSections=Секции ВМ
VMTools=Инструменты виртуализации (VMware/Virtual PC/Sandboxie)
Warning=Внимание
WatermarkCount=В незарегистрированной версии можно создать только один водяной знак
WatermarkDisabled=Водяной знак "%s" недоступен для использования
WatermarkExist=Водяной знак "%s" уже существует
WatermarkName=Название водяного знака
WatermarkNotFound=Водяной знак "%s" не найден в списке водяных знаков
Watermarks=Водяные знаки
WatermarkUsed=Водяной знак "%s" используется в защищенных файлах
Wizard=Мастер
Yes=Да
YesToAll=Да для всех

[Manager]
About...=О Программе...
Contents...=Просмотр справки...
Customers=Покупатели
Edit=Правка
File=Файл
Help=Справка
New=Создать
Objects=Объекты
Open...=Открыть...
Licenses=Лицензии
Products=Продукты
Save=Сохранить
View=Вид
AboutComment=Отображение информации о программе.
AboutTitle=О Программе
AboutTooltip=О программе
ContentsComment=Отображение справочной информации
ContentsTooltip=Справка
AddCustomer=Добавить покупателя
Address=Адрес
Blocked=Лицензия заблокирована
Cancel=Отмена
Change=Изменить
ChangeWindowPos=Изменение положения окна.
ChangeWindowSize=Изменение размеров окна.
CloseWindow=Закрытие активного окна.
Comments=Примечания
Customer=Покупатель
CustomerDetails=Информация о покупателе
Date=Дата
Delete=Удалить
Discount=Скидка
Exit=Выход
EMail=Электронная почта
EditObject=Параметры
ExitComment=Завершение работы программы.
LanguageWillBeChangedAtTheNextStart=Выбранный язык будет использован при следующем запуске программы
MaximizeWindow=Развертывание окна до предельного размера.
MinimizeWindow=Свертывание окна в значок.
NewCustomer=Новый покупатель
NewDocComment=Создание новой базы данных.
NewDocTooltip=Новая база
NewLicense=Новая лицензия
NewProduct=Новый продукт
No=Нет
Yes=Да
OK=ОК
OpenDocComment=Открытие существующей базы данных.
OpenDocTooltip=Открыть базу
OpenMRU=Открытие этой базы данных.
License=Лицензия
LicenseDetails=Информация о лицензии
Licenses by Customers=Лицензии по Покупателям
Licenses by Products=Лицензии по Продуктам
Phone=Телефон
Price=Цена
ProductTitle=Продукт
ProductDetails=Информация о продукте
Ready=Готово
Recent File=Недавние документы
Referrer=Посредник
RestoreWindow=Восстановление исходных размеров окна.
Save As...=Сохранить как...
Save changes to %1?=Сохранить изменения в %1?
SaveAsDocComment=Сохранение текущей базы данных в другом файле.
SaveAsDocTooltip=Сохранить как
SaveDocComment=Сохранение текущей базы данных.
SaveDocTooltip=Сохранить
SelectCustomer=Выброр покупателя
SerialNumber=Серийный номер
Show Status Bar=Строка состояния
Show Toolbar=Панель инструментов
ShowStatusbarComment=Вывод и скрытие строки состояния.
ShowToolbarComment=Вывод и скрытие панели инструментов.
Site=Сайт
Title=Название
Version=Версия


CustomerProperties=Параметры покупателя
LicenseProperties=Параметры лицензии
ProductProperties=Параметры продукта
Language=Язык интерфейса

DeleteObjectComment=Удаление выделенного объекта.
EditObjectComment=Редактирование выделенного объекта.
CustomersComment=Отображение списка покупателей.
NewCustomerComment=Создание нового покупателя.
NewLicenseComment=Создание новой лицензии.
NewProductComment=Создание нового продукта.
LicensesByCustomersComment=Отображение списка лицензий, сгруппированного по покупателям.
LicensesByProductComment=Отображение списка лицензий, сгруппированного по продуктам.
LicensesComment=Отображение списка лицензий.
ProductsComment=Отображение списка продуктов.

DeleteObjectTooltip=Удалить объект
EditObjectTooltip=Редактировать объект
CustomersTooltip=Покупатели
NewCustomerTooltip=Новый покупатель
NewLicenseTooltip=Новая лицензия
NewProductTooltip=Новый продукт
LicensesByCustomersTooltip=Лицензии по покупателям
LicensesByProductTooltip=Лицензии по продуктам
LicensesTooltip=Лицензии
ProductsTooltip=Продукты

UnableToOpenFile=Ошибка при открытии базы данных "%s"\nФайл поврежден или у Вас недостаточно прав для работы с ним\n\nТехнические детали ошибки:\n%s.
UnableToSaveFile=Ошбика при сохранении базы данных в "%s".\nУбедитесь, что у Вас достаточно прав для сохранения в этот каталог, а также что на диске достаточно места.\n\nКод ошибки: %d.

OpenLastDocument=Открывать последний документ

Undo=Отменить
UndoComment=Отмена последней операции.
UndoTooltip=Отменить
Redo=Повторить
RedoComment=Повторение последней отмененной операции.
RedoTooltip=Повторить

DatabaseErrorDetails=%s\nКод ошибки: %d

SerialNumberAlgorithm=Алгоритм
AlgorithmBits=Длина ключа
ProductNewKeyPair=Сделанные изменения потребуют генерации нового ключа. Все номера, созданные для продукта ранее, станут недействительны.\nТакже потребуется заново защитить программу с использованием нового ключа.\n\nВы уверены, что хотите изменить ключ?

Undefined=Не задан
SerialNumberWillBeGenerated=Серийный номер будет сгенерирован после нажатия на кнопку ОК.
NeedToSelectCustomer=Необходимо выбрать покупателя.

Unknown=Неизвестный
LicenseSettingsFileFilter=Проект VMProtect
...=...
PathToSettingsFile=Проект VMProtect
NeedToSetTitle=Необходимо указать название продукта

ExceptionFormatString=Произошла ошибка! Пожалуйста, сообщите об этом разработчикам.\nСкопировать текст этого сообщения можно при помощи комбинации Ctrl+C.\n\nТип исключения: %s\nМесто: %s\nПодробная информация:\n%s

UnableToSaveSettingsFile=Не удалось сохранить файл настроек VMProtect\nУбедитесь, что путь корректен и у вас достаточные права доступа.\nФайл: "%s"\nКод ошибки: %d

CustomerName=Имя покупателя
DatabaseLicenseData=Информация о лицензии
SerialNumberLicenseData=Содержимое серийного номера
Block=Заблокировать
Unblock=Разблокировать
CopySerialNumber=Скопировать номер
OrderRef=Номер заказа
HardwareID=ID компьютера
ExpDate=Срок годности
RunningTimeLimit=Макс. время работы
UserData=Данные
ShowLicenses=Показать лицензии
(minutes)=(в минутах)
SerialNumberData=Данные ключа (использовано байт: %d/%d)
NewLicenseFieldIsTooLong=Данных в поле "%s" слишком много: %d байт.\nМаксимальное допустимое количество байт для этого поля: %d (в кодировке UTF-8).
InvalidHardwareId=Введен неправильный или пустой идентификатор компьютера.
SerialNumberDataIsTooLong=Слишком много данных в серийном номере.\nМаксимальноe количество байт: %d, использовано: %d.
UserDataIsTooLong=Превышен максимальный размер пользовательских данных.\nМаксимальноe количество байт: %d, использовано: %d.

FindLicense=Поиск лицензии
FindLicenseComment=Поиск лицензии
FindLicenseTooltip=Поиск лицензии
ImportLicense=Импорт лицензии
ImportLicenseComment=Импорт лицензии
ImportLicenseTooltip=Импорт лицензии
PasteSerialNumber=Введите серийный номер:
FindLicenseCantFindSerialNumber=Не удается найти такой серийный номер.\nБолее того, он не подходит ни к одному из продуктов.
FindLicenseDoYouWantToImport=Это серийный номер от продукта "%s".\nТакого номера в базе нет, импортировать?
ImportSerialNumberAlreadyExist=Этот серийный номер уже есть в базе данных.\nПовторный импорт невозможен.
ImportLicenseInvalidSerialNumber=Этот серийный номер не подходит ни к одному из продуктов в базе данных.

Untitled=Безымянный
VMPLMDocument=База лицензий
VMPLicenseManager=Менеджер лицензий VMProtect
Filter=Фильтр:

ProductCode=Код продукта
MaxBuildDate=Макс. дата сборки

ExportKeyPair=Экспорт Ключа
ProductKeyChangedCommitFirst=Похоже, что Вы только что меняли параметры ключа продукта.\nДля обеспечения корректности экспорта, пожалуйста, подтвердите изменения нажатием кнопки "ОК" в окне свойств продукта.
Close=Закрыть
KeyPairExportTarget=Формат экспорта:
KeyPairExportResult=Результат экспорта:
ExportForKeyGenDll=Параметры для KeyGen.dll (MSVC)
ExportForKeyGenDll_PAS=Параметры для KeyGen.dll (Delphi)
ExportForKeyGenPHP=Параметры для keygen.php
ExportForKeyGenNet=Параметры для KeyGen.Net
Copy=Копировать
FilterBox=Задать фильтр
FilterBoxComment=Позволяет изменить фильтрацию
FilterBoxTooltop=Задать фильтр
FilterCueBanner=Фильтр
HardwareId_Part_CPU=Процессор
HardwareId_Part_Host=Хост
HardwareId_Part_Mac=Сеть
HardwareId_Part_HDD=Жесткий диск
HWIDParser=Анализ идентификатора компьютера
HWIDParser_Column_Type=Устройство
HWIDParser_Column_Value=Идентификатор

DoYouWantToCreateCustomerByLicense=Серийный номер содержит информацию о покупателе, однако в базе такого покупателя нет.\nХотите создать запись о покупателе на основании данных серийного номера?

AboutHome=Домашняя страница
AboutEMail=Электронная почта
AboutWarning=Внимание! Данная программа защищена законом об авторских правах и международными соглашениями. Незаконное копирование или распространение данной программы или любой её части влечет гражданскую или уголовную ответственность.

NoHelpFile=Не удается открыть файл справки